mattehicks/SCDE/components/ESP32_TouchGUI1_Module/include/tft.h
/*
 * Set the screen rotation
 * Also resets the clip window and clears the screen with current background color
 *
 * Params:
 * 		rot:	0~3; screen rotation; use defined rotation constants:
 * 				PORTRAIT, LANDSCAPE, PORTRAIT_FLIP, LANDSCAPE_FLIP
 *
 */
//--------------------------------
void TFT_setRotation(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint8_t rot);

/*
 * Set inverted/normal colors
 *
 * Params:
 * 		mode:	0 or 1; use defined constants: INVERT_ON or INVERT_OFF
 *
 */
//-----------------------------------------
void TFT_invertDisplay(const uint8_t mode);

/*
 * Select gamma curve
 * Params:
 *      gamma: gama curve, values 0~3
 */
//=================================
void TFT_setGammaCurve(uint8_t gm);

/*
 * Compare two color structures
 * Returns 0 if equal, 1 if not equal
 *
 * Params:
 * 		c1, c2:	colors to be compared
 */
//---------------------------------------------
int TFT_compare_colors(color_t c1, color_t c2);

/*
 * returns the string width in pixels.
 * Useful for positions strings on the screen.
 */
//--------------------------------
int TFT_getStringWidth(char* str);


/*
 * Fills the rectangle occupied by string with current background color
 */
void TFT_clearStringRect(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int x, int y, char *str);

/*
 * Converts the components of a color, as specified by the HSB model,
 * to an equivalent set of values for the default RGB model.

 * The color structure that is returned by HSBtoRGB encodes the value of a color as R, G & B component
 *
 * Params:
 * 		   _hue:	float;	any number, the floor of this number is subtracted from it to create a fraction between 0 and 1.
 * 							This fractional number is then multiplied by 360 to produce the hue angle in the HSB color model.
 * 		   _sat:	float; 0 ~ 1.0
 *	_brightness:	float; 0 ~ 1.0
 *
*/
//----------------------------------------------------------
color_t HSBtoRGB(float _hue, float _sat, float _brightness);

/*
 * Decodes and displays JPG image
 * Limits:
 * 		Baseline only. Progressive and Lossless JPEG format are not supported.
 *		Image size: Up to 65520 x 65520 pixels
 *		Color space: YCbCr three components only. Gray scale image is not supported.
 *		Sampling factor: 4:4:4, 4:2:2 or 4:2:0.
 *
 * Params:
 *       x: image left position; constants CENTER & RIGHT can be used; negative value is accepted
 *       y: image top position;  constants CENTER & BOTTOM can be used; negative value is accepted
 *   scale: image scale factor: 0~3; if scale>0, image is scaled by factor 1/(2^scale) (1/2, 1/4 or 1/8)
 *   fname: pointer to the name of the file from which the image will be read
 *   		if set to NULL, image will be read from memory buffer pointed to by 'buf'
 *     buf: pointer to the memory buffer from which the image will be read; used if fname=NULL
 *    size: size of the memory buffer from which the image will be read; used if fname=NULL & buf!=NULL
 *
 */
//-----------------------------------------------------------------------------------
void TFT_jpg_image(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int x, int y, uint8_t scale, char *fname, uint8_t *buf, int size);

/*
 * Decodes and displays BMP image
 * Only uncompressed RGB 24-bit with no color space information BMP images can be displayed
 *
 * Params:
 *       x: image left position; constants CENTER & RIGHT can be used; negative value is accepted
 *       y: image top position;  constants CENTER & BOTTOM can be used; negative value is accepted
 *   scale: image scale factor: 0~7; if scale>0, image is scaled by factor 1/(scale+1)
 *   fname: pointer to the name of the file from which the image will be read
 *   		if set to NULL, image will be read from memory buffer pointed to by 'imgbuf'
 *  imgbuf: pointer to the memory buffer from which the image will be read; used if fname=NULL
 *    size: size of the memory buffer from which the image will be read; used if fname=NULL & imgbuf!=NULL
 *
 */
//-------------------------------------------------------------------------------------
int TFT_bmp_image(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int x, int y, uint8_t scale, char *fname, uint8_t *imgbuf, int size);

/*
 * Get the touch panel coordinates.
 * The coordinates are adjusted to screen orientation if raw=0
 *
 * Params:
 * 		x: pointer to X coordinate
 * 		y: pointer to Y coordinate
 * 	  raw: if 0 returns calibrated screen coordinates; if 1 returns raw touch controller coordinates
 *
 * Returns:
 * 		0 if touch panel is not touched; x=y=0
 * 		1 if touch panel is touched; x&y are the valid coordinates
 */
//----------------------------------------------
int TFT_read_touch(int *x, int* y, uint8_t raw);


/*
 * Compile font c source file to .fnt file
 * which can be used in TFT_setFont() function to select external font
 * Created file have the same name as source file and extension .fnt
 *
 * Params:
 *		fontfile: pointer to c source font file name; must have .c extension
 *			 dbg: if set to 1, prints debug information
 *
 * Returns:
 * 		0 on success
 * 		err no on error
 *
 */
//------------------------------------------------
int compile_font_file(char *fontfile, uint8_t dbg);

/*
 * Get all font's characters to buffer
 */
void getFontCharacters(uint8_t *buf);

#endif
